# Fictitious Names

In [4]:
raw_data_1 = {
        'subject_id': ['1', '2', '3', '4', '5'],
        'first_name': ['Alex', 'Amy', 'Allen', 'Alice', 'Ayoung'],
        'last_name': ['Anderson', 'Ackerman', 'Ali', 'Aoni', 'Atiches']}
raw_data_2 = {
        'subject_id': ['4', '5', '6', '7', '8'],
        'first_name': ['Billy', 'Brian', 'Bran', 'Bryce', 'Betty'],
        'last_name': ['Bonder', 'Black', 'Balwner', 'Brice', 'Btisan']}
raw_data_3 = {
        'subject_id': ['1', '2', '3', '4', '5', '7', '8', '9', '10', '11'],
        'test_id': [51, 15, 15, 61, 16, 14, 15, 1, 61, 16]}

### Step 2. Create the 3 DataFrames based on the following raw data

In [7]:
import numpy as np
import pandas as pd

In [8]:
df_1 = pd.DataFrame(raw_data_1)
df_2 = pd.DataFrame(raw_data_2)
df_3 = pd.DataFrame(raw_data_3)

### Step 3. Assign each to a variable called data1, data2, data3

In [9]:
data1 = df_1
data2 = df_2
data3 = df_3

In [13]:
print(data1.info())
print("\n---------------------\n")
data2.info()
print("\n---------------------\n")
data3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   subject_id  5 non-null      object
 1   first_name  5 non-null      object
 2   last_name   5 non-null      object
dtypes: object(3)
memory usage: 248.0+ bytes
None

---------------------

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   subject_id  5 non-null      object
 1   first_name  5 non-null      object
 2   last_name   5 non-null      object
dtypes: object(3)
memory usage: 248.0+ bytes

---------------------

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   subject_id  10 non-null     object
 1   test_id     10 non-null     int64
dtypes: int64(1), object(1)
memory usage: 288.0+ bytes

In [22]:
print(data1)
print("\n---------------------\n")
print(data2)
print("\n---------------------\n")
print(data3)

  subject_id first_name last_name
0          1       Alex  Anderson
1          2        Amy  Ackerman
2          3      Allen       Ali
3          4      Alice      Aoni
4          5     Ayoung   Atiches

---------------------

  subject_id first_name last_name
0          4      Billy    Bonder
1          5      Brian     Black
2          6       Bran   Balwner
3          7      Bryce     Brice
4          8      Betty    Btisan

---------------------

  subject_id  test_id
0          1       51
1          2       15
2          3       15
3          4       61
4          5       16
5          7       14
6          8       15
7          9        1
8         10       61
9         11       16

### Step 4. Join the two first dataframes along rows and assign to all_data

In [26]:
all_data = pd.concat([data1, data2], axis=0)
all_data

  subject_id first_name last_name
0          1       Alex  Anderson
1          2        Amy  Ackerman
2          3      Allen       Ali
3          4      Alice      Aoni
4          5     Ayoung   Atiches
0          4      Billy    Bonder
1          5      Brian     Black
2          6       Bran   Balwner
3          7      Bryce     Brice
4          8      Betty    Btisan

### Step 5. Join the two first dataframes along columns and assing to all_data_col

In [27]:
all_data_col = pd.concat([data1, data2], axis=1)
all_data_col

  subject_id first_name last_name subject_id first_name last_name
0          1       Alex  Anderson          4      Billy    Bonder
1          2        Amy  Ackerman          5      Brian     Black
2          3      Allen       Ali          6       Bran   Balwner
3          4      Alice      Aoni          7      Bryce     Brice
4          5     Ayoung   Atiches          8      Betty    Btisan

### Step 6. Print the unique values of data3

In [ ]:
print(data3)

# para ver los diferentes tests que contiene data3
print('\n Unique Tests:', data3['test_id'].unique())

# para ver los diferentes subjects que contiene data3
print('\n Unique Subjects:', data3['subject_id'].unique())

  subject_id  test_id
0          1       51
1          2       15
2          3       15
3          4       61
4          5       16
5          7       14
6          8       15
7          9        1
8         10       61
9         11       16

 Unique Tests: [51 15 61 16 14  1]

 Unique Subjects: ['1' '2' '3' '4' '5' '7' '8' '9' '10' '11']
Valores únicos en subject_id: ['1' '2' '3' '4' '5' '7' '8' '9' '10' '11']
Valores únicos en test_id: [51 15 61 16 14  1]

### Step 7. Merge all_data and data3 along the subject_id value

In [ ]:
print('all_data:\n', all_data)
print('\ndata3:\n', data3)

# merge con subject_id como columna clave, 
# y método 'inner', que sólo incluye las filas con subject_id en ambos dataframes (8 registros)
# si quisiéramos obtener los test_id para cada sujeto, haríamos un left join, aunque para subject_id 6 no hay datos sobre su test
# si quisiéramos darle a cada test un sujeto, haríamos un right join, pero habría tests que no tendrían sujeto.
# con outer join, añadiríamos los subject_id de un dataframe al otro, de manera que tendríamos 12 registros.
merged_df = pd.merge(all_data, data3, on='subject_id', how='inner')
print('\nmerged dataframe:\n', merged_df)

all_data:
   subject_id first_name last_name
0          1       Alex  Anderson
1          2        Amy  Ackerman
2          3      Allen       Ali
3          4      Alice      Aoni
4          5     Ayoung   Atiches
0          4      Billy    Bonder
1          5      Brian     Black
2          6       Bran   Balwner
3          7      Bryce     Brice
4          8      Betty    Btisan

data3:
   subject_id  test_id
0          1       51
1          2       15
2          3       15
3          4       61
4          5       16
5          7       14
6          8       15
7          9        1
8         10       61
9         11       16

merged dataframe:
   subject_id first_name last_name  test_id
0          1       Alex  Anderson       51
1          2        Amy  Ackerman       15
2          3      Allen       Ali       15
3          4      Alice      Aoni       61
4          5     Ayoung   Atiches       16
5          4      Billy    Bonder       61
6          5      Brian     Black       16
7          7      Bryce     Brice       14
8          8      Betty    Btisan       15

### Step 8. Merge only the data that has the same 'subject_id' on both data1 and data2

In [ ]:
# claramente están pidiendo un inner join (2 coincidencias)
merged_inner = pd.merge(data1, data2, on='subject_id', how='inner')
merged_inner

  subject_id first_name_x last_name_x first_name_y last_name_y
0          4        Alice        Aoni        Billy      Bonder
1          5       Ayoung     Atiches        Brian       Black

### Step 9. Merge all values in data1 and data2, with matching records and not matching records from both sides where available.

In [68]:
# claramente están pidiendo un outer join (2 coincidencias)
merged_outer = pd.merge(data1, data2, on='subject_id', how='outer')
merged_outer

  subject_id first_name_x last_name_x first_name_y last_name_y
0          1         Alex    Anderson          NaN         NaN
1          2          Amy    Ackerman          NaN         NaN
2          3        Allen         Ali          NaN         NaN
3          4        Alice        Aoni        Billy      Bonder
4          5       Ayoung     Atiches        Brian       Black
5          6          NaN         NaN         Bran     Balwner
6          7          NaN         NaN        Bryce       Brice
7          8          NaN         NaN        Betty      Btisan